Tekla Open API Reference for Tekla Structures 2025
StringConverter Methods
The StringConverter type exposes the following members.
Methods
Name | Description
CanConvertFrom
 Checks whether the conversion can be made from the source type to the string datatype.
 (Overrides TypeConverter.CanConvertFrom(ITypeDescriptorContext, Type).)
CanConvertTo
 Checks whether the conversion can be made from the string datatype to the destination type.
 (Overrides TypeConverter.CanConvertTo(ITypeDescriptorContext, Type).)
ConvertFrom
 Converts an object from the given culture to the Tekla.Structures.Datatype.String type.
 (Overrides TypeConverter.ConvertFrom(ITypeDescriptorContext, CultureInfo, Object).)
ConvertTo
 Converts an object from the string datatype to the given destination type.
 (Overrides TypeConverter.ConvertTo(ITypeDescriptorContext, CultureInfo, Object, Type).)
Top
See Also
Reference
StringConverter Class
Tekla.Structures.Datatype Namespace